Revit 2024 API
BuiltInFailures.ElectricalFailures.NotSupportConcentricBend Property
 Conduit with Fittings do not support Concentric Bend Radius, the bend radius of the conduit fittings will be same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotSupportConcentricBend { get; }
Visual Basic
Public Shared ReadOnly Property NotSupportConcentricBend As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotSupportConcentricBend {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace